<?php

//其他配置
return [
    //广告类型
    'adsType' => [
        [
            'label'=>'横幅',
            'value'=>'11',
        ],
        [
            'label'=>'小图标',
            'value'=>'12',
            'disabled'=> true
        ],
        [
            'label'=>'信息流',
            'value'=>'13',
            'disabled'=> true
        ]
    ],

    'imgSize' => [
        '1' => [
            'width' => 640,
            'height' => 100,
        ],
        '2' => [
            'width' => 640,
            'height' => 150,
        ],
        '3' => [
            'width' => 640,
            'height' => 200,
        ],
        '4' => [
            'width' => 640,
            'height' => 250,
        ],
        '5' => [
            'width' => 100,
            'height' => 100,
        ],
        '6' => [
            'width' => 250,
            'height' => 250,
        ],
        '7' => [
            'width' => 300,
            'height' => 250,
        ],
    ],

    'hours' => ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23']
];
