<template>
    <div class="content">

        <div class="protocol" v-loading="loading">

            <h3>领航移动广告投放协议</h3>

            <p class="weight" style="text-align: right;">协议编号：{{data.user.signa_number}}</p>
            
            
            <p class="weight">甲方：<input type="text" v-model="data.user.signa_company"/></p>
            
            <p class="weight">乙方：杭州麦雨网络科技有限公司</p>
            
            <p>根据《中华人民共和国协议法》及有关规定，甲乙双方本着诚实信用、平等互利的原则，就乙方为甲方提供网络信息服务事宜签订本协议。</p>
            
            <p class="weight">一、甲方权利与义务</p>
            
            <p>1、在本协议有效期间，甲方负责在规定的时间内向乙方提供服务所需要的相关文件，包括图片信息、广告推广地址信息、图片规格等。若由于甲方原因而造成的任何迟延，甲方自行承担责任</p>
            
            <p>2、甲方保证乙方为投放的广告地址所链接的甲方网站或甲方提供的信息等内容真实可靠，符合《中华人民共和国计算机信息网络国际联网暂行规定》和国家的有关法律、法令、法规的规定，如有产生用户投诉和由于通过乙方投放的甲方信息所引起的政治、法律、经济责任等后果，甲方应负全部责任，乙方对此不承担任何责任；甲方网络页面亦不能有窗口弹出。</p>
            
            <p>3、甲方应按本协议的“<span class="weight">费用支付</span>”条款规定向乙方支付信息服务费并签订附件-“<span class="weight">网络信息安全承诺书</span>”。</p>

            <p class="weight">二、乙方权利与义务</p>

            <p>1、乙方提供广告投放服务，按甲方要求投放广告。</p>

            <p>2、对于甲方提供的广告内容，乙方有权根据《中华人民共和国计算机信息网络国际联网暂行规定》进行审核，对于不符合以上法律法规的信息乙方有权拒绝服务。</p>

            <p>3、乙方负责正确统计所投放广告的点击和展示次数并且以此判断服务质量作为计算服务费的依据。</p>

            <p>4、乙方负责监督所投放广告显示次数的有效性。</p>

            <p>5、在网页投放过程中，甲方认为被投放网站存在作弊行为，需提供有效证据，证实之后，乙方应返还所有与作弊数据相对应的服务费给甲方。</p>
            
            <p class="weight">三、违约责任与赔偿</p>

            <p>本协议接受中华人民共和国法律的制约，在协议有效期内，任一方违反约定则视为违约，应承担以下违约责任：</p>

            <p>1、停止违约行为；</p>

            <p>2、经对方要求继续履行协议；</p>

            <p>3、赔偿对方因此而受到的全部直接及间接损失，赔偿金额由受损失一方提出，经双方协商解决；</p>

            <p class="weight">四、费用支付</p>

            <p>1、甲方需委托乙方投放的标的网站投放WAP广告，服务费单价(含税)为：协商价。</p>

            <p>2、付款方式预付款制。</p>

            <p>投放前的一个工作日内，将款项汇入乙方指定的银行帐号，未能及时汇款，则本协议视作无效。乙方在收到甲方预付款之日起三个工作日内，向甲方提供等额有效的正规增值税专用发票。</p>

            <p class="weight">五、协议有效期： 2018年04月17日至长期。</p>

            <p class="weight">六、争议解决</p>

            <p>双方因协议的解释或履行产生争议，由双方协商解决。如协商不成，双方均有权向有管辖权的人民法院起诉。</p>

            <p class="weight">七、知识产权的保护</p>

            <p>1、双方使用的所有硬件、软件、程序、密码、商品名、技术、许可证、专利、商标、技术知识等皆归各方所有，不存在任何权利瑕疵，另一方及第三方对于此无任何权利或利益。</p>

            <p>2、双方在本协议有效期间获知的对方的商业秘密、技术秘密等需双方保密的事项，在协议期间及协议终止后叁年内不得向第三方披露或公开，否则承担相应法律责任。</p>

            <p>　　1）、一般义务：一方必须对自另一方所获取的商业秘密严格保密，在未事先取得另一方书面同意的情况下，不得向任何第三方披露。</p>

            <p>　　2）、任何一方在下列任一情形下披露商业秘密不视为违反本协议：</p>

            <p>　　a、该信息在披露时已为公众所知悉；</p>

            <p>　　b、该信息根据另一方事先书面同意而披露；</p>

            <p>　　c、一方按照对其有管辖权的政府司法等部门依据中国法律法规执行公务时的要求而批露，前提为披露之前一方先以书面形式将披露的商业秘密的确切性质通知另一方。</p>

            <p>3、本第七条所有相关保密款项之规定并不因本协议的解除、终止、撤消而失效。</p>

            <p class="weight">八、终止</p>

            <p>1、 终止之情形</p>

            <p>本协议于下列任一情形出现时即终止：</p>

            <p>　　1）、双方按照协议规定的条款履行协议，乙方未能按照要求完成甲方委托的广告信息投放事宜；</p>

            <p>　　2）、甲方与乙方协商后撤销广告信息的投放；</p>

            <p>　　3）、出现违反本协议第一条款第二点规定之情形，则乙方有权利终止本协议的执行；</p>

            <p>　　4）、任何一方宣布破产或进入清算过解散程序；</p>

            <p>　　5）、如不可抗力持续三十（30）日以上，任何一方发出终止本协议的书面通知；</p>

            <p>　　6）、其他法律、法规规定的终止情况。</p>

            <p>2 、终止后之事项</p>

            <p>本协议之终止并不影响本协议项下已履行部分的结算付款义务。</p>

            <p class="weight">九、附则</p>

            <p>1、一经确认，等同甲方同意并签订本协议，本协议自签订日期起具有法律效力。</p>

            <p>2、本协议一式贰份，双方各执壹份，具同等法律效力。协议附件及补充协议具备同等法律效力，如附件及补充协议的内容与本协议内容有冲突之处，则以附件及补充协议的详细说明条款为准。</p>

            <p>3、未尽事宜</p>

            <p>本协议之未尽事宜，双方另行协商后签订补充协议解决，补充协议与本协议具有同等法律效力。</p>
            <br/>
            <el-row class="signature">
                <el-col :span="12">
                    
                    <p class="weight">甲　　方：<input type="text" v-model="data.user.signa_company"/></p>
            
                    <p>甲方签字：<input type="text" v-model="data.user.signa_name"/></p>

                    <p>日　　期：2018年04月17日</p>

                </el-col>
                <el-col :span="12">
                
                    <p class="weight">乙　　方：杭州麦雨网络科技有限公司</p>

                    <p>乙方签字：田勇建</p>

                    <p>日　　期：2018年04月17日</p>

                </el-col>
            </el-row>
            <br/>

            <br/>
            <h3>网络信息安全承诺书</h3>
            <br/>

            <p>为保障互联网网络安全和信息安全，投放国家安全、社会秩序和公共利益，本人（单位）郑重向贵司承诺遵守本承诺书的有关条款，如有违反本承诺书有关条款的行为，由本人（单位）承担由此带来的一切民事、行政和刑事责任。</p>

            <p>一、本人（单位）承诺遵守《中华人民共和国计算机信息系统安全保护条例》和《计算机信息网络国际联网安全保护管理办法》及其他国家有关法律、法规和行政规章制度。</p>

            <p>二、本人（单位）已知悉并承诺遵守《电信业务经营许可管理办法》、《互联网IP地址备案管理办法》、《非经营性互联网信息服务备案管理办法》、等国家相关部门有关文件的规定。</p>

            <p>三、本人（单位）保证不利用网络危害国家安全、泄露国家秘密，不侵犯国家的、社会的、集体的利益和第三方的合法权益，不从事违法犯罪活动。</p>

            <p>四、本人（单位）承诺严格按照国家相关的法律法规做好本单位网站的信息安全管理工作，按政府有关部门要求设立信息安全责任人和信息安全审查员。</p>

            <p>五、本人（单位）保证发布的信息来源可靠、真实,不制作、复制、发布、传播下列信息：</p>

            <p>　　1、反对宪法所确定的基本原则的；</p>

            <p>　　2、危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>

            <p>　　3、损害国家荣誉和利益的；</p>

            <p>　　4、煽动民族仇恨、民族歧视，破坏民族团结的；</p>

            <p>　　5、破坏国家宗教政策，宣扬邪教和封建迷信的；</p>

            <p>　　6、散布谣言，扰乱社会秩序，破坏社会稳定的；</p>

            <p>　　7、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>

            <p>　　8、侮辱或者诽谤他人，侵害他人合法权益的；</p>

            <p>　　9、含有法律、行政法规禁止的其他内容的。</p>

            <p>六、本人（单位）保证提供的网络信息页面设计及投放等内容或设计服务所需资料享有合法正当的权利，包括但不限于知识产权保护或许可使用权，其没有侵犯任何第三方之合法权益。</p>

            <p>七、本人（单位）保证任何由于本身的误导性的虚假宣传或夸大宣传引起之争议、诉求、纠纷的所有相关法律责任均由本单位自行承担。</p>

            <p>八、本人（单位）承诺不从事以下危害计算机信息网络安全的活动：</p>

            <p>　　1、不进行故意制作、传播计算机病毒等破坏性程序的活动；</p>

            <p>　　2、其他危害计算机信息网络安全的。</p>

            <p>九、本人（单位）承诺当计算机信息系统发生重大安全事故时，立即采取应急措施，保留有关原始记录，并在24小时内向政府监管部门报告并书面知会贵单位。</p>

            <p>十、若违反本承诺书有关条款和国家相关法律法规的，本人（单位）直接承担相应法律责任，造成财产损失的，由人（单位）直接赔偿，贵司有权停止服务。</p>

            <p>十一、本承诺书自签署之日起生效。</p>
            <br/>
            <el-row class="signature">
                <el-col :span="12">
                &nbsp;
                </el-col>
                <el-col :span="12">

                    <p>承诺人(单位)：<input type="text" v-model="data.user.signa_company"/></p>

                    <p>日期：2018年04月17日</p>

                </el-col>
            </el-row>

            <div style="text-align: center;">
                <el-button type="primary" size="mini" v-if=" data.user.is_signa!='1' " @click="putUser">确认</el-button>
                <el-button size="mini">取消</el-button>
            </div>
            <br/>
        </div>

    </div>
</template>
<script>
export default {
    name: 'protocol',
    data: function () { 
        return {
            group: Group,
            loading: false,
            data: {
                user: {},
            },
        };
    },
    created: function () {

        this.group.page = '/advertiser/protocol';

        this.getUser();
    },
    methods:{
        getUser: function() {

            var Th = this;

            Th.loading = true;
            
            Th.$api.get('advertiser/user.json', {}, function(data){
                
                Th.data.user = data.user;
                
                Th.loading = false;

            }, function(type, message){ Th.loading = false; Th.$emit('message', type, message); });
        },
        putUser: function() {
            
            var Th = this;

            if(!Th.data.user.signa_company || !Th.data.user.signa_name)
            {
                Th.$emit('message', 'error', '请填写公司和签字人');
            
            }
            else
            {
                Th.loading = true;

                Th.$api.put('advertiser/user.json', Th.data.user, function(data)
                {
                    Th.loading = false;

                    Th.$emit('message', 'success', '签署成功');

                }, function(type, message){ Th.loading = false; Th.$emit('message', type, message); });
            }

        },

    },
}
</script>